/*
  Copyright (C) 2004 Kimmo Pekkola

  This program is free software; you can redistribute it and/or
  modify it under the terms of the GNU General Public License
  as published by the Free Software Foundation; either version 2
  of the License, or (at your option) any later version.

  This program is distributed in the hope that it will be useful,
  but WITHOUT ANY WARRANTY; without even the implied warranty of
  MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
  GNU General Public License for more details.

  You should have received a copy of the GNU General Public License
  along with this program; if not, write to the Free Software
  Foundation, Inc., 59 Temple Place - Suite 330, Boston, MA  02111-1307, USA.
*/
/*
  $Header: /home/cvsroot/Rainlendar/Plugins/PluginOutlook/OutlookPlugin.cpp,v 1.4 2005/10/14 17:05:29 rainy Exp $

  $Log: OutlookPlugin.cpp,v $
  Revision 1.4  2005/10/14 17:05:29  rainy
  no message

  Revision 1.3  2005/09/08 16:13:51  rainy
  no message

  Revision 1.2  2005/09/08 16:09:12  rainy
  no message

  Revision 1.1.1.1  2005/07/10 18:48:07  rainy
  no message

  Revision 1.4  2005/03/25 13:59:47  rainy
  no message

  Revision 1.3  2005/03/01 18:33:11  rainy
  Added possibility to select which message stores are imported.
  No direct linking to mapi32.dll anymore.

  Revision 1.2  2004/12/05 18:14:35  rainy
  Made the code more robust

  Revision 1.1  2004/11/06 13:32:07  rainy
  Initial version

*/

#pragma warning(disable: 4786)

	TCHAR tmpSz[4096];
	TCHAR tmpSz2[4096];

	WritePrivateProfileString(PLUGIN_NAME, _T("OutlookProfile"), g_OutlookProfile.c_str(), configFile);

	sprintf(tmpSz, "%i", g_KeepAlive);
	WritePrivateProfileString(PLUGIN_NAME, _T("OutlookKeepAlive"), tmpSz, configFile);

	sprintf(tmpSz, "%i", g_UseLabels);
	WritePrivateProfileString(PLUGIN_NAME, _T("OutlookLabels"), tmpSz, configFile);

	sprintf(tmpSz, "%i", g_NoMessageBody);
	WritePrivateProfileString(PLUGIN_NAME, _T("NoMessageBody"), tmpSz, configFile);
	
	sprintf(tmpSz, "%i", g_NoDoneTasks);
	WritePrivateProfileString(PLUGIN_NAME, _T("NoDoneTasks"), tmpSz, configFile);

	sprintf(tmpSz, "%i", g_WatchChanges);
	WritePrivateProfileString(PLUGIN_NAME, _T("WatchChanges"), tmpSz, configFile);

	int count = 0;
	for (int i = 0; i < g_Stores.size(); i++)
	{
		for (int j = 0; j < g_Stores[i].folders.size(); j++)
		{
			count++;
			sprintf(tmpSz2, "MessageStore%i", count);
			sprintf(tmpSz, "%s\\%s", g_Stores[i].name.c_str(), g_Stores[i].folders[j].c_str());
			WritePrivateProfileString(PLUGIN_NAME, tmpSz2, tmpSz, configFile);

			sprintf(tmpSz2, "MessageStoreID%i", count);
			sprintf(tmpSz, "%s\\%s", g_Stores[i].storeID.c_str(), g_Stores[i].folderIDs[j].c_str());
			WritePrivateProfileString(PLUGIN_NAME, tmpSz2, tmpSz, configFile);
		}
	}

	sprintf(tmpSz, "%i", count);
	WritePrivateProfileString(PLUGIN_NAME, _T("MessageStoreCount"), tmpSz, configFile);
}


// http://www.geocities.com/cainrandom/dev/MAPIRecurrence.html
// http://www.cdolive.com/cdo10.htm


enum { E_ROOT_DEFAULT = 0, E_ROOT_EID, E_ROOT_PROPS};
SizedSPropTagArray(E_ROOT_PROPS, rootProps) = 
{ E_ROOT_PROPS, 
	{	
		PR_DEFAULT_STORE, 
		PR_ENTRYID
	} 
};

enum { E_DATASTORE_EID = 0, E_DATASTORE_NAME, E_DATASTORE_CONTAINER, E_DATASTORE_PROPS};
SizedSPropTagArray(E_DATASTORE_PROPS, datastoreProps) =
{ E_DATASTORE_PROPS,
    {   
		PR_ENTRYID,
        PR_DISPLAY_NAME,
        PR_CONTAINER_CLASS
    }
}; 

SizedSPropTagArray(1, messageEIDProps) =
{
    1,
    {
		PR_ENTRYID,
	}
};

enum { E_MESSAGE_EID = 0, E_MESSAGE_SUBJECT, E_MESSAGE_BODY, E_MESSAGE_START_DATE, E_MESSAGE_END_DATE, E_MESSAGE_VALID_UNTIL, E_MESSAGE_LOCATION, E_MESSAGE_RECURRENCE, E_MESSAGE_ALLDAY, E_MESSAGE_REMINDER, E_MESSAGE_REMINDERMINS, E_MESSAGE_LABEL, E_MESSAGE_PROPS};
SizedSPropTagArray(E_MESSAGE_PROPS, messageProps) =
{
    E_MESSAGE_PROPS,
    {
		PR_ENTRYID,
        PR_SUBJECT,
        PR_BODY,
		0,		// PR_APPOINTMENT_START,
		0,		// PR_APPOINTMENT_END,
		0,		// PR_APPOINTMENT_VALID_UNTIL,
		0,		// PR_APPOINTMENT_LOCATION,
		0,		// PR_APPOINTMENT_RECURRENCE,
		0,		// PR_APPOINTMENT_ALLDAY
		0,		// PR_APPOINTMENT_REMINDERSET
		0,		// PR_APPOINTMENT_REMIDERBEFOREMINS
		0		// PR_APPOINTMENT_LABEL,		(label must be that last)
    }
};

enum { E_TODO_EID = 0, E_TODO_SUBJECT, E_TODO_STATUS, E_TODO_ORDINAL, E_TODO_PROPS };
SizedSPropTagArray(E_TODO_PROPS, todoProps) =
{
    E_TODO_PROPS,
    {
		PR_ENTRYID,
        PR_SUBJECT,
		0,		// Status,
		0,		// Ordinal
    }
};

#pragma pack(1)

struct RECURRENCE_HEADER
{
	ULONG unknown1;		// 0x04, 0x30, 0x04, 0x30
	UCHAR type;
	UCHAR unknown2;		// 0x20
	ULONG type2;		// Recurrence type
};

struct RECURRENCE_DAILY
{
	ULONG unknown1;		// 0x04, 0x30, 0x04, 0x30
	UCHAR type;
	UCHAR unknown2;		// 0x20
	ULONG type2;		// Recurrence type
	// Daily stuff starts here
	ULONG separation;
	ULONG interval;
	ULONG unknown3;		// 0x00
	
	UCHAR terminationType;	// Type of pattern termination: 0x21 for terminating on a given date, 0x22 for terminating after a given number of recurrences, or 0x23 for never terminating (recurring infinitely)
	UCHAR unknown4;		// 0x20
	UCHAR unknown5;		// 0x00
	UCHAR unknown6;		// 0x00
	ULONG occurences;	// Number of occurrences in pattern: 0 for infinite recurrence, otherwise supply the value, even if it terminates on a given date, not after a given number
};

struct RECURRENCE_WEEKLY
{
	ULONG unknown1;		// 0x04, 0x30, 0x04, 0x30
	UCHAR type;
	UCHAR unknown2;		// 0x20
	ULONG type2;		// Recurrence type
	// Weekly stuff starts here
	ULONG separation;
	ULONG interval;
	ULONG unknown3;		// 0x00
	ULONG bitmask;

	UCHAR terminationType;	// Type of pattern termination: 0x21 for terminating on a given date, 0x22 for terminating after a given number of recurrences, or 0x23 for never terminating (recurring infinitely)
	UCHAR unknown4;		// 0x20
	UCHAR unknown5;		// 0x00
	UCHAR unknown6;		// 0x00
	ULONG occurences;	// Number of occurrences in pattern: 0 for infinite recurrence, otherwise supply the value, even if it terminates on a given date, not after a given number
};

struct RECURRENCE_MONTHLY
{
	ULONG unknown1;		// 0x04, 0x30, 0x04, 0x30
	UCHAR type;
	UCHAR unknown2;		// 0x20
	ULONG type2;		// Recurrence type
	// Monthly stuff starts here
	ULONG separation;
	ULONG interval;
	ULONG unknown3;		// 0x00
	ULONG day;

	UCHAR terminationType;	// Type of pattern termination: 0x21 for terminating on a given date, 0x22 for terminating after a given number of recurrences, or 0x23 for never terminating (recurring infinitely)
	UCHAR unknown4;		// 0x20
	UCHAR unknown5;		// 0x00
	UCHAR unknown6;		// 0x00
	ULONG occurences;	// Number of occurrences in pattern: 0 for infinite recurrence, otherwise supply the value, even if it terminates on a given date, not after a given number
};

struct RECURRENCE_MONTHLY2
{
	ULONG unknown1;		// 0x04, 0x30, 0x04, 0x30
	UCHAR type;
	UCHAR unknown2;		// 0x20
	ULONG type2;		// Recurrence type
	// Monthly stuff starts here
	ULONG separation;
	ULONG interval;
	ULONG unknown3;		// 0x00
	ULONG y;
	ULONG x;

	UCHAR terminationType;	// Type of pattern termination: 0x21 for terminating on a given date, 0x22 for terminating after a given number of recurrences, or 0x23 for never terminating (recurring infinitely)
	UCHAR unknown4;		// 0x20
	UCHAR unknown5;		// 0x00
	UCHAR unknown6;		// 0x00
	ULONG occurences;	// Number of occurrences in pattern: 0 for infinite recurrence, otherwise supply the value, even if it terminates on a given date, not after a given number
};

struct RECURRENCE_YEARLY
{
	ULONG unknown1;		// 0x04, 0x30, 0x04, 0x30
	UCHAR type;
	UCHAR unknown2;		// 0x20
	ULONG type2;		// Recurrence type
	// Yearly stuff starts here
	ULONG separation;
	ULONG interval;
	ULONG unknown3;		// 0x00
	ULONG day;

	UCHAR terminationType;	// Type of pattern termination: 0x21 for terminating on a given date, 0x22 for terminating after a given number of recurrences, or 0x23 for never terminating (recurring infinitely)
	UCHAR unknown4;		// 0x20
	UCHAR unknown5;		// 0x00
	UCHAR unknown6;		// 0x00
	ULONG occurences;	// Number of occurrences in pattern: 0 for infinite recurrence, otherwise supply the value, even if it terminates on a given date, not after a given number
};


void ConvertFileTime(FILETIME* pft)
{
	SYSTEMTIME utcSysTime;
	SYSTEMTIME localSysTime;
	FileTimeToSystemTime(pft, &utcSysTime);

	if (SystemTimeToTzSpecificLocalTime(NULL, &utcSysTime, &localSysTime))
	{
		SystemTimeToFileTime(&localSysTime, pft);
	}
}


void SetMonthlyRecurrence2(LPSRow prow, RainlendarRecurrency* newRecurrency, RECURRENCE_MONTHLY2* recurrence)
{
	if (recurrence->y == 0x7f)
	{
		newRecurrency->type = RECURRENCY_TYPE_MONTHLY_LAST_DAY;		// Last day of the month
	}
	else if (recurrence->y == 0x3f && recurrence->x == 5)
	{
		newRecurrency->type = RECURRENCY_TYPE_MONTHLY_LAST_WEEKDAY;	// Last weekday of the month
	}
	else if (recurrence->y == 0x3f && recurrence->x == 1)
	{
		newRecurrency->type = RECURRENCY_TYPE_MONTHLY_FIRST_WEEKDAY;	// First weekday of the month
	}
